zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_mcasp.h
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_PID register.
//
//******************************************************************************
#define MCASP_PID_SCHEME_M      0xC0000000
#define MCASP_PID_SCHEME_S      30
#define MCASP_PID_RESV_M        0x30000000
#define MCASP_PID_RESV_S        28
#define MCASP_PID_FUNCTION_M    0x0FFF0000  // McASP
#define MCASP_PID_FUNCTION_S    16
#define MCASP_PID_RTL_M         0x0000F800
#define MCASP_PID_RTL_S         11
#define MCASP_PID_REVMAJOR_M    0x00000700
#define MCASP_PID_REVMAJOR_S    8
#define MCASP_PID_CUSTOM_M      0x000000C0  // non-custom
#define MCASP_PID_CUSTOM_S      6
#define MCASP_PID_REVMINOR_M    0x0000003F
#define MCASP_PID_REVMINOR_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the
// MCASP_O_ESYSCONFIG register.
//
//******************************************************************************
#define MCASP_ESYSCONFIG_RSV_M  0xFFFFFFC0  // Reserved as per PDR 3.5
#define MCASP_ESYSCONFIG_RSV_S  6
#define MCASP_ESYSCONFIG_OTHER_M \
                                0x0000003C  // Reserved for future expansion

#define MCASP_ESYSCONFIG_OTHER_S 2
#define MCASP_ESYSCONFIG_IDLE_MODE_M \
                                0x00000003  // Idle Mode

#define MCASP_ESYSCONFIG_IDLE_MODE_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_PFUNC register.
//
//******************************************************************************
#define MCASP_PFUNC_AFSR        0x80000000  // AFSR PFUNC 31 0 1
#define MCASP_PFUNC_AHCLKR      0x40000000  // AHCLKR PFUNC 30 0 1
#define MCASP_PFUNC_ACLKR       0x20000000  // ACLKR PFUNC 29 0 1
#define MCASP_PFUNC_AFSX        0x10000000  // AFSX PFUNC 28 0 1
#define MCASP_PFUNC_AHCLKX      0x08000000  // AHCLKX PFUNC 27 0 1
#define MCASP_PFUNC_ACLKX       0x04000000  // ACLKX PFUNC 26 0 1
#define MCASP_PFUNC_AMUTE       0x02000000  // AMUTE PFUNC 25 0 1
#define MCASP_PFUNC_RESV1_M     0x01FF0000  // Reserved
#define MCASP_PFUNC_RESV1_S     16
#define MCASP_PFUNC_AXR15       0x00008000  // AXR PFUNC BIT 15 0 1
#define MCASP_PFUNC_AXR14       0x00004000  // AXR PFUNC BIT 14 0 1
#define MCASP_PFUNC_AXR13       0x00002000  // AXR PFUNC BIT 13 0 1
#define MCASP_PFUNC_AXR12       0x00001000  // AXR PFUNC BIT 12 0 1
#define MCASP_PFUNC_AXR11       0x00000800  // AXR PFUNC BIT 11 0 1
#define MCASP_PFUNC_AXR10       0x00000400  // AXR PFUNC BIT 10 0 1
#define MCASP_PFUNC_AXR9        0x00000200  // AXR PFUNC BIT 9 0 1
#define MCASP_PFUNC_AXR8        0x00000100  // AXR PFUNC BIT 8 0 1
#define MCASP_PFUNC_AXR7        0x00000080  // AXR PFUNC BIT 7 0 1
#define MCASP_PFUNC_AXR6        0x00000040  // AXR PFUNC BIT 6 0 1
#define MCASP_PFUNC_AXR5        0x00000020  // AXR PFUNC BIT 5 0 1
#define MCASP_PFUNC_AXR4        0x00000010  // AXR PFUNC BIT 4 0 1
#define MCASP_PFUNC_AXR3        0x00000008  // AXR PFUNC BIT 3 0 1
#define MCASP_PFUNC_AXR2        0x00000004  // AXR PFUNC BIT 2 0 1
#define MCASP_PFUNC_AXR1        0x00000002  // AXR PFUNC BIT 1 0 1
#define MCASP_PFUNC_AXR0        0x00000001  // AXR PFUNC BIT 0 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_PDIR register.
//
//******************************************************************************
#define MCASP_PDIR_AFSR         0x80000000  // AFSR PDIR 31 0 1
#define MCASP_PDIR_AHCLKR       0x40000000  // AHCLKR PDIR 30 0 1
#define MCASP_PDIR_ACLKR        0x20000000  // ACLKR PDIR 29 0 1
#define MCASP_PDIR_AFSX         0x10000000  // AFSX PDIR 28 0 1
#define MCASP_PDIR_AHCLKX       0x08000000  // AHCLKX PDIR 27 0 1
#define MCASP_PDIR_ACLKX        0x04000000  // ACLKX PDIR 26 0 1
#define MCASP_PDIR_AMUTE        0x02000000  // AMUTE PDIR 25 0 1
#define MCASP_PDIR_RESV_M       0x01FF0000  // Reserved
#define MCASP_PDIR_RESV_S       16
#define MCASP_PDIR_AXR15        0x00008000  // AXR PDIR BIT 15 0 1
#define MCASP_PDIR_AXR14        0x00004000  // AXR PDIR BIT 14 0 1
#define MCASP_PDIR_AXR13        0x00002000  // AXR PDIR BIT 13 0 1
#define MCASP_PDIR_AXR12        0x00001000  // AXR PDIR BIT 12 0 1
#define MCASP_PDIR_AXR11        0x00000800  // AXR PDIR BIT 11 0 1
#define MCASP_PDIR_AXR10        0x00000400  // AXR PDIR BIT 10 0 1
#define MCASP_PDIR_AXR9         0x00000200  // AXR PDIR BIT 9 0 1
#define MCASP_PDIR_AXR8         0x00000100  // AXR PDIR BIT 8 0 1
#define MCASP_PDIR_AXR7         0x00000080  // AXR PDIR BIT 7 0 1
#define MCASP_PDIR_AXR6         0x00000040  // AXR PDIR BIT 6 0 1
#define MCASP_PDIR_AXR5         0x00000020  // AXR PDIR BIT 5 0 1
#define MCASP_PDIR_AXR4         0x00000010  // AXR PDIR BIT 4 0 1
#define MCASP_PDIR_AXR3         0x00000008  // AXR PDIR BIT 3 0 1
#define MCASP_PDIR_AXR2         0x00000004  // AXR PDIR BIT 2 0 1
#define MCASP_PDIR_AXR1         0x00000002  // AXR PDIR BIT 1 0 1
#define MCASP_PDIR_AXR0         0x00000001  // AXR PDIR BIT 0 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_PDOUT register.
//
//******************************************************************************
#define MCASP_PDOUT_AFSR        0x80000000  // AFSR PDOUT 31 0 1
#define MCASP_PDOUT_AHCLKR      0x40000000  // AHCLKR PDOUT 30 0 1
#define MCASP_PDOUT_ACLKR       0x20000000  // ACLKR PDOUT 29 0 1
#define MCASP_PDOUT_AFSX        0x10000000  // AFSX PDOUT 28 0 1
#define MCASP_PDOUT_AHCLKX      0x08000000  // AHCLKX PDOUT 27 0 1
#define MCASP_PDOUT_ACLKX       0x04000000  // ACLKX PDOUT 26 0 1
#define MCASP_PDOUT_AMUTE       0x02000000  // AMUTE PDOUT 25 0 1
#define MCASP_PDOUT_RESV_M      0x01FF0000  // Reserved
#define MCASP_PDOUT_RESV_S      16
#define MCASP_PDOUT_AXR15       0x00008000  // AXR PDOUT BIT 15 0 1
#define MCASP_PDOUT_AXR14       0x00004000  // AXR PDOUT BIT 14 0 1
#define MCASP_PDOUT_AXR13       0x00002000  // AXR PDOUT BIT 13 0 1
#define MCASP_PDOUT_AXR12       0x00001000  // AXR PDOUT BIT 12 0 1
#define MCASP_PDOUT_AXR11       0x00000800  // AXR PDOUT BIT 11 0 1
#define MCASP_PDOUT_AXR10       0x00000400  // AXR PDOUT BIT 10 0 1
#define MCASP_PDOUT_AXR9        0x00000200  // AXR PDOUT BIT 9 0 1
#define MCASP_PDOUT_AXR8        0x00000100  // AXR PDOUT BIT 8 0 1
#define MCASP_PDOUT_AXR7        0x00000080  // AXR PDOUT BIT 7 0 1
#define MCASP_PDOUT_AXR6        0x00000040  // AXR PDOUT BIT 6 0 1
#define MCASP_PDOUT_AXR5        0x00000020  // AXR PDOUT BIT 5 0 1
#define MCASP_PDOUT_AXR4        0x00000010  // AXR PDOUT BIT 4 0 1
#define MCASP_PDOUT_AXR3        0x00000008  // AXR PDOUT BIT 3 0 1
#define MCASP_PDOUT_AXR2        0x00000004  // AXR PDOUT BIT 2 0 1
#define MCASP_PDOUT_AXR1        0x00000002  // AXR PDOUT BIT 1 0 1
#define MCASP_PDOUT_AXR0        0x00000001  // AXR PDOUT BIT 0 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_PDSET register.
//
//******************************************************************************
#define MCASP_PDSET_AFSR        0x80000000
#define MCASP_PDSET_AHCLKR      0x40000000
#define MCASP_PDSET_ACLKR       0x20000000
#define MCASP_PDSET_AFSX        0x10000000
#define MCASP_PDSET_AHCLKX      0x08000000
#define MCASP_PDSET_ACLKX       0x04000000
#define MCASP_PDSET_AMUTE       0x02000000
#define MCASP_PDSET_RESV_M      0x01FF0000  // Reserved
#define MCASP_PDSET_RESV_S      16
#define MCASP_PDSET_AXR15       0x00008000
#define MCASP_PDSET_AXR14       0x00004000
#define MCASP_PDSET_AXR13       0x00002000
#define MCASP_PDSET_AXR12       0x00001000
#define MCASP_PDSET_AXR11       0x00000800
#define MCASP_PDSET_AXR10       0x00000400
#define MCASP_PDSET_AXR9        0x00000200
#define MCASP_PDSET_AXR8        0x00000100
#define MCASP_PDSET_AXR7        0x00000080
#define MCASP_PDSET_AXR6        0x00000040
#define MCASP_PDSET_AXR5        0x00000020
#define MCASP_PDSET_AXR4        0x00000010
#define MCASP_PDSET_AXR3        0x00000008
#define MCASP_PDSET_AXR2        0x00000004
#define MCASP_PDSET_AXR1        0x00000002
#define MCASP_PDSET_AXR0        0x00000001
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_PDIN register.
//
//******************************************************************************
#define MCASP_PDIN_AFSR         0x80000000
#define MCASP_PDIN_AHCLKR       0x40000000
#define MCASP_PDIN_ACLKR        0x20000000
#define MCASP_PDIN_AFSX         0x10000000
#define MCASP_PDIN_AHCLKX       0x08000000
#define MCASP_PDIN_ACLKX        0x04000000
#define MCASP_PDIN_AMUTE        0x02000000
#define MCASP_PDIN_RESV_M       0x01FF0000  // Reserved
#define MCASP_PDIN_RESV_S       16
#define MCASP_PDIN_AXR15        0x00008000
#define MCASP_PDIN_AXR14        0x00004000
#define MCASP_PDIN_AXR13        0x00002000
#define MCASP_PDIN_AXR12        0x00001000
#define MCASP_PDIN_AXR11        0x00000800
#define MCASP_PDIN_AXR10        0x00000400
#define MCASP_PDIN_AXR9         0x00000200
#define MCASP_PDIN_AXR8         0x00000100
#define MCASP_PDIN_AXR7         0x00000080
#define MCASP_PDIN_AXR6         0x00000040
#define MCASP_PDIN_AXR5         0x00000020
#define MCASP_PDIN_AXR4         0x00000010
#define MCASP_PDIN_AXR3         0x00000008
#define MCASP_PDIN_AXR2         0x00000004
#define MCASP_PDIN_AXR1         0x00000002
#define MCASP_PDIN_AXR0         0x00000001
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_PDCLR register.
//
//******************************************************************************
#define MCASP_PDCLR_AFSR        0x80000000  // AFSR PDCLR 31 0 1
#define MCASP_PDCLR_AHCLKR      0x40000000  // AHCLKR PDCLR 30 0 1
#define MCASP_PDCLR_ACLKR       0x20000000  // ACLKR PDCLR 29 0 1
#define MCASP_PDCLR_AFSX        0x10000000  // AFSX PDCLR 28 0 1
#define MCASP_PDCLR_AHCLKX      0x08000000  // AHCLKX PDCLR 27 0 1
#define MCASP_PDCLR_ACLKX       0x04000000  // ACLKX PDCLR 26 0 1
#define MCASP_PDCLR_AMUTE       0x02000000  // AMUTE PDCLR 25 0 1
#define MCASP_PDCLR_RESV_M      0x01FF0000  // Reserved
#define MCASP_PDCLR_RESV_S      16
#define MCASP_PDCLR_AXR15       0x00008000  // AXR PDCLR BIT 15 0 1
#define MCASP_PDCLR_AXR14       0x00004000  // AXR PDCLR BIT 14 0 1
#define MCASP_PDCLR_AXR13       0x00002000  // AXR PDCLR BIT 13 0 1
#define MCASP_PDCLR_AXR12       0x00001000  // AXR PDCLR BIT 12 0 1
#define MCASP_PDCLR_AXR11       0x00000800  // AXR PDCLR BIT 11 0 1
#define MCASP_PDCLR_AXR10       0x00000400  // AXR PDCLR BIT 10 0 1
#define MCASP_PDCLR_AXR9        0x00000200  // AXR PDCLR BIT 9 0 1
#define MCASP_PDCLR_AXR8        0x00000100  // AXR PDCLR BIT 8 0 1
#define MCASP_PDCLR_AXR7        0x00000080  // AXR PDCLR BIT 7 0 1
#define MCASP_PDCLR_AXR6        0x00000040  // AXR PDCLR BIT 6 0 1
#define MCASP_PDCLR_AXR5        0x00000020  // AXR PDCLR BIT 5 0 1
#define MCASP_PDCLR_AXR4        0x00000010  // AXR PDCLR BIT 4 0 1
#define MCASP_PDCLR_AXR3        0x00000008  // AXR PDCLR BIT 3 0 1
#define MCASP_PDCLR_AXR2        0x00000004  // AXR PDCLR BIT 2 0 1
#define MCASP_PDCLR_AXR1        0x00000002  // AXR PDCLR BIT 1 0 1
#define MCASP_PDCLR_AXR0        0x00000001  // AXR PDCLR BIT 0 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TLGC register.
//
//******************************************************************************
#define MCASP_TLGC_RESV_M       0xFFFF0000  // Reserved
#define MCASP_TLGC_RESV_S       16
#define MCASP_TLGC_MT_M         0x0000C000  // MISR on/off trigger command 0x0
                                            // 0x1 0x2 0x3
#define MCASP_TLGC_MT_S         14
#define MCASP_TLGC_RESV1_M      0x00003E00  // Reserved
#define MCASP_TLGC_RESV1_S      9
#define MCASP_TLGC_MMS          0x00000100  // Source of MISR input 0 1
#define MCASP_TLGC_ESEL         0x00000080  // Output enable select 0 1
#define MCASP_TLGC_TOEN         0x00000040  // Test output enable control. 0 1
#define MCASP_TLGC_MC_M         0x00000030  // States of MISR 0x0 0x1 0x2 0x3
#define MCASP_TLGC_MC_S         4
#define MCASP_TLGC_PC_M         0x0000000E  // Pattern code 0x0 0x1 0x2 0x3 0x4
                                            // 0x5 0x6 0x7
#define MCASP_TLGC_PC_S         1
#define MCASP_TLGC_TM           0x00000001  // Tie high; do not write to this
                                            // bit 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TLMR register.
//
//******************************************************************************
#define MCASP_TLMR_TLMR_M       0xFFFFFFFF  // Contains test result signature.
#define MCASP_TLMR_TLMR_S       0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TLEC register.
//
//******************************************************************************
#define MCASP_TLEC_TLEC_M       0xFFFFFFFF  // Contains number of cycles during
                                            // which MISR sig will be
                                            // accumulated.
#define MCASP_TLEC_TLEC_S       0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_GBLCTL register.
//
//******************************************************************************
#define MCASP_GBLCTL_XFRST      0x00001000  // Frame sync generator reset 0 1
#define MCASP_GBLCTL_XSMRST     0x00000800  // XMT state machine reset 0 1
#define MCASP_GBLCTL_XSRCLR     0x00000400  // XMT serializer clear 0 1
#define MCASP_GBLCTL_XHCLKRST   0x00000200  // XMT High Freq. clk Divider 0 1
#define MCASP_GBLCTL_XCLKRST    0x00000100  // XMT clock divder reset 0 1
#define MCASP_GBLCTL_RFRST      0x00000010  // Frame sync generator reset 0 1
#define MCASP_GBLCTL_RSMRST     0x00000008  // RCV state machine reset 0 1
#define MCASP_GBLCTL_RSRCLR     0x00000004  // RCV serializer clear 0 1
#define MCASP_GBLCTL_RHCLKRST   0x00000002  // RCV High Freq. clk Divider 0 1
#define MCASP_GBLCTL_RCLKRST    0x00000001  // RCV clock divder reset 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_AMUTE register.
//
//******************************************************************************
#define MCASP_AMUTE_XDMAERR     0x00001000  // MUTETXDMAERR occur 0 1
#define MCASP_AMUTE_RDMAERR     0x00000800  // MUTERXDMAERR occur 0 1
#define MCASP_AMUTE_XCKFAIL     0x00000400  // XMT bad clock 0 1
#define MCASP_AMUTE_RCKFAIL     0x00000200  // RCV bad clock 0 1
#define MCASP_AMUTE_XSYNCERR    0x00000100  // XMT unexpected FS 0 1
#define MCASP_AMUTE_RSYNCERR    0x00000080  // RCV unexpected FS 0 1
#define MCASP_AMUTE_XUNDRN      0x00000040  // XMT underrun occurs 0 1
#define MCASP_AMUTE_ROVRN       0x00000020  // RCV overun occurs 0 1
#define MCASP_AMUTE_INSTAT      0x00000010
#define MCASP_AMUTE_INEN        0x00000008  // drive AMUTE active on mute in
                                            // active 0 1
#define MCASP_AMUTE_INPOL       0x00000004  // Mute input polarity 0 1
#define MCASP_AMUTE_MUTEN_M     0x00000003  // AMUTE pin enable 0x0 0x1 0x2
#define MCASP_AMUTE_MUTEN_S     0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_LBCTL register.
//
//******************************************************************************
#define MCASP_LBCTL_IOLBEN      0x00000010  // IO loopback enable 0 1
#define MCASP_LBCTL_MODE_M      0x0000000C  // Loop back clock source generator
                                            // 0x0 0x1 0x2 0x3
#define MCASP_LBCTL_MODE_S      2
#define MCASP_LBCTL_ORD         0x00000002  // Loopback order 0 1
#define MCASP_LBCTL_DLBEN       0x00000001  // Loop back mode 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXDITCTL register.
//
//******************************************************************************
#define MCASP_TXDITCTL_VB       0x00000008  // Valib bit for odd TDM 0 1
#define MCASP_TXDITCTL_VA       0x00000004  // Valib bit for even TDM 0 1
#define MCASP_TXDITCTL_DITEN    0x00000001  // XMT DIT Mode Enable 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_GBLCTLR register.
//
//******************************************************************************
#define MCASP_GBLCTLR_XFRST     0x00001000
#define MCASP_GBLCTLR_XSMRST    0x00000800
#define MCASP_GBLCTLR_XSRCLR    0x00000400
#define MCASP_GBLCTLR_XHCLKRST  0x00000200
#define MCASP_GBLCTLR_XCLKRST   0x00000100
#define MCASP_GBLCTLR_RFRST     0x00000010  // Frame sync generator reset 0 1
#define MCASP_GBLCTLR_RSMRST    0x00000008  // RCV state machine reset 0 1
#define MCASP_GBLCTLR_RSRCLR    0x00000004  // RCV serializer clear 0 1
#define MCASP_GBLCTLR_RHCLKRST  0x00000002  // RCV High Freq. clk Divider 0 1
#define MCASP_GBLCTLR_RCLKRST   0x00000001  // RCV clock divder reset 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXMASK register.
//
//******************************************************************************
#define MCASP_RXMASK_RMASK31    0x80000000  // RMASK BIT 31 0 1
#define MCASP_RXMASK_RMASK30    0x40000000  // RMASK BIT 30 0 1
#define MCASP_RXMASK_RMASK29    0x20000000  // RMASK BIT 29 0 1
#define MCASP_RXMASK_RMASK28    0x10000000  // RMASK BIT 28 0 1
#define MCASP_RXMASK_RMASK27    0x08000000  // RMASK BIT 27 0 1
#define MCASP_RXMASK_RMASK26    0x04000000  // RMASK BIT 26 0 1
#define MCASP_RXMASK_RMASK25    0x02000000  // RMASK BIT 25 0 1
#define MCASP_RXMASK_RMASK24    0x01000000  // RMASK BIT 24 0 1
#define MCASP_RXMASK_RMASK23    0x00800000  // RMASK BIT 23 0 1
#define MCASP_RXMASK_RMASK22    0x00400000  // RMASK BIT 22 0 1
#define MCASP_RXMASK_RMASK21    0x00200000  // RMASK BIT 21 0 1
#define MCASP_RXMASK_RMASK20    0x00100000  // RMASK BIT 20 0 1
#define MCASP_RXMASK_RMASK19    0x00080000  // RMASK BIT 19 0 1
#define MCASP_RXMASK_RMASK18    0x00040000  // RMASK BIT 18 0 1
#define MCASP_RXMASK_RMASK17    0x00020000  // RMASK BIT 17 0 1
#define MCASP_RXMASK_RMASK16    0x00010000  // RMASK BIT 16 0 1
#define MCASP_RXMASK_RMASK15    0x00008000  // RMASK BIT 15 0 1
#define MCASP_RXMASK_RMASK14    0x00004000  // RMASK BIT 14 0 1
#define MCASP_RXMASK_RMASK13    0x00002000  // RMASK BIT 13 0 1
#define MCASP_RXMASK_RMASK12    0x00001000  // RMASK BIT 12 0 1
#define MCASP_RXMASK_RMASK11    0x00000800  // RMASK BIT 11 0 1
#define MCASP_RXMASK_RMASK10    0x00000400  // RMASK BIT 10 0 1
#define MCASP_RXMASK_RMASK9     0x00000200  // RMASK BIT 9 0 1
#define MCASP_RXMASK_RMASK8     0x00000100  // RMASK BIT 8 0 1
#define MCASP_RXMASK_RMASK7     0x00000080  // RMASK BIT 7 0 1
#define MCASP_RXMASK_RMASK6     0x00000040  // RMASK BIT 6 0 1
#define MCASP_RXMASK_RMASK5     0x00000020  // RMASK BIT 5 0 1
#define MCASP_RXMASK_RMASK4     0x00000010  // RMASK BIT 4 0 1
#define MCASP_RXMASK_RMASK3     0x00000008  // RMASK BIT 3 0 1
#define MCASP_RXMASK_RMASK2     0x00000004  // RMASK BIT 2 0 1
#define MCASP_RXMASK_RMASK1     0x00000002  // RMASK BIT 1 0 1
#define MCASP_RXMASK_RMASK0     0x00000001  // RMASK BIT 0 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXFMT register.
//
//******************************************************************************
#define MCASP_RXFMT_RDATDLY_M   0x00030000  // RCV Frame sync delay 0x0 0 Bit
                                            // delay 0x1 1 Bit delay 0x2 2 Bit
                                            // delay
#define MCASP_RXFMT_RDATDLY_S   16
#define MCASP_RXFMT_RRVRS       0x00008000  // RCV serial stream bit order 0 1
#define MCASP_RXFMT_RPAD_M      0x00006000  // Pad value 0x0 0x1 0x2
#define MCASP_RXFMT_RPAD_S      13
#define MCASP_RXFMT_RPBIT_M     0x00001F00  // Pad bit position
#define MCASP_RXFMT_RPBIT_S     8
#define MCASP_RXFMT_RSSZ_M      0x000000F0  // RCV slot Size 0x0 0x1 0x2 0x3
                                            // 0x4 0x5 0x6 0x7 0x8 0x9 0xA 0xB
                                            // 0xC 0xD 0xE 0xF
#define MCASP_RXFMT_RSSZ_S      4
#define MCASP_RXFMT_RBUSEL      0x00000008  // Write to RBUF using CPU/DMA 0
                                            // DMA port access 1 CPU port Access
#define MCASP_RXFMT_RROT_M      0x00000007  // Right Rotate Value 0x0 0x1 0x2
                                            // 0x3 0x4 0x5 0x6 0x7
#define MCASP_RXFMT_RROT_S      0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXFMCTL register.
//
//******************************************************************************
#define MCASP_RXFMCTL_RMOD_M    0x0000FF80  // RCV Frame sync mode
#define MCASP_RXFMCTL_RMOD_S    7
#define MCASP_RXFMCTL_FRWID     0x00000010  // RCV Frame sync Duration 0 1
#define MCASP_RXFMCTL_FSRM      0x00000002  // RCV frame sync External 0 1
#define MCASP_RXFMCTL_FSRP      0x00000001  // RCV Frame sync Polarity 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_ACLKRCTL register.
//
//******************************************************************************
#define MCASP_ACLKRCTL_BUSY     0x00100000
#define MCASP_ACLKRCTL_DIVBUSY  0x00080000
#define MCASP_ACLKRCTL_ADJBUSY  0x00040000
#define MCASP_ACLKRCTL_CLKRADJ_M \
                                0x00030000

#define MCASP_ACLKRCTL_CLKRADJ_S 16
#define MCASP_ACLKRCTL_CLKRP    0x00000080  // RCV Clock Polarity 0 1
#define MCASP_ACLKRCTL_CLKRM    0x00000020  // RCV clock source 0 1
#define MCASP_ACLKRCTL_CLKRDIV_M \
                                0x0000001F  // RCV clock devide ratio

#define MCASP_ACLKRCTL_CLKRDIV_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_AHCLKRCTL register.
//
//******************************************************************************
#define MCASP_AHCLKRCTL_BUSY    0x00100000
#define MCASP_AHCLKRCTL_DIVBUSY 0x00080000
#define MCASP_AHCLKRCTL_ADJBUSY 0x00040000
#define MCASP_AHCLKRCTL_HCLKRADJ_M \
                                0x00030000

