zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_mcasp.h
#define MCASP_AHCLKXCTL_HCLKXDIV_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXTDM register.
//
//******************************************************************************
#define MCASP_TXTDM_XTDMS31     0x80000000  // XMT mode during TDM time slot 31
                                            // 0 1
#define MCASP_TXTDM_XTDMS30     0x40000000  // XMT mode during TDM time slot 30
                                            // 0 1
#define MCASP_TXTDM_XTDMS29     0x20000000  // XMT mode during TDM time slot 29
                                            // 0 1
#define MCASP_TXTDM_XTDMS28     0x10000000  // XMT mode during TDM time slot 28
                                            // 0 1
#define MCASP_TXTDM_XTDMS27     0x08000000  // XMT mode during TDM time slot 27
                                            // 0 1
#define MCASP_TXTDM_XTDMS26     0x04000000  // XMT mode during TDM time slot 26
                                            // 0 1
#define MCASP_TXTDM_XTDMS25     0x02000000  // XMT mode during TDM time slot 25
                                            // 0 1
#define MCASP_TXTDM_XTDMS24     0x01000000  // XMT mode during TDM time slot 24
                                            // 0 1
#define MCASP_TXTDM_XTDMS23     0x00800000  // XMT mode during TDM time slot 23
                                            // 0 1
#define MCASP_TXTDM_XTDMS22     0x00400000  // XMT mode during TDM time slot 22
                                            // 0 1
#define MCASP_TXTDM_XTDMS21     0x00200000  // XMT mode during TDM time slot 21
                                            // 0 1
#define MCASP_TXTDM_XTDMS20     0x00100000  // XMT mode during TDM time slot 20
                                            // 0 1
#define MCASP_TXTDM_XTDMS19     0x00080000  // XMT mode during TDM time slot 19
                                            // 0 1
#define MCASP_TXTDM_XTDMS18     0x00040000  // XMT mode during TDM time slot 18
                                            // 0 1
#define MCASP_TXTDM_XTDMS17     0x00020000  // XMT mode during TDM time slot 17
                                            // 0 1
#define MCASP_TXTDM_XTDMS16     0x00010000  // XMT mode during TDM time slot 16
                                            // 0 1
#define MCASP_TXTDM_XTDMS15     0x00008000  // XMT mode during TDM time slot 15
                                            // 0 1
#define MCASP_TXTDM_XTDMS14     0x00004000  // XMT mode during TDM time slot 14
                                            // 0 1
#define MCASP_TXTDM_XTDMS13     0x00002000  // XMT mode during TDM time slot 13
                                            // 0 1
#define MCASP_TXTDM_XTDMS12     0x00001000  // XMT mode during TDM time slot 12
                                            // 0 1
#define MCASP_TXTDM_XTDMS11     0x00000800  // XMT mode during TDM time slot 11
                                            // 0 1
#define MCASP_TXTDM_XTDMS10     0x00000400  // XMT mode during TDM time slot 10
                                            // 0 1
#define MCASP_TXTDM_XTDMS9      0x00000200  // XMT mode during TDM time slot 9
                                            // 0 1
#define MCASP_TXTDM_XTDMS8      0x00000100  // XMT mode during TDM time slot 8
                                            // 0 1
#define MCASP_TXTDM_XTDMS7      0x00000080  // XMT mode during TDM time slot 7
                                            // 0 1
#define MCASP_TXTDM_XTDMS6      0x00000040  // XMT mode during TDM time slot 6
                                            // 0 1
#define MCASP_TXTDM_XTDMS5      0x00000020  // XMT mode during TDM time slot 5
                                            // 0 1
#define MCASP_TXTDM_XTDMS4      0x00000010  // XMT mode during TDM time slot 4
                                            // 0 1
#define MCASP_TXTDM_XTDMS3      0x00000008  // XMT mode during TDM time slot 3
                                            // 0 1
#define MCASP_TXTDM_XTDMS2      0x00000004  // XMT mode during TDM time slot 2
                                            // 0 1
#define MCASP_TXTDM_XTDMS1      0x00000002  // XMT mode during TDM time slot 1
                                            // 0 1
#define MCASP_TXTDM_XTDMS0      0x00000001  // XMT mode during TDM time slot 0
                                            // 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_EVTCTLX register.
//
//******************************************************************************
#define MCASP_EVTCTLX_XSTAFRM   0x00000080  // XMT Start of Frame Interrupt 0 1
#define MCASP_EVTCTLX_XDATA     0x00000020  // XMT Data Interrupt 0 1
#define MCASP_EVTCTLX_XLAST     0x00000010  // XMT Last Slot Interrupt 0 1
#define MCASP_EVTCTLX_XDMAERR   0x00000008  // XMT DMA Bus Error 0 1
#define MCASP_EVTCTLX_XCKFAIL   0x00000004  // Bad Clock Interrupt 0 1
#define MCASP_EVTCTLX_XSYNCERR  0x00000002  // XMT Unexpected FSR Interrupt 0 1
#define MCASP_EVTCTLX_XUNDRN    0x00000001  // XMT Underrun Interrupt 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXSTAT register.
//
//******************************************************************************
#define MCASP_TXSTAT_XERR       0x00000100  // XMT Error 0 1
#define MCASP_TXSTAT_XDMAERR    0x00000080  // XMT DMA bus error 0 1
#define MCASP_TXSTAT_XSTAFRM    0x00000040  // Start of Frame-XMT 0 1
#define MCASP_TXSTAT_XDATA      0x00000020  // Data Ready Flag 0 1
#define MCASP_TXSTAT_XLAST      0x00000010  // Last Slot Interrupt Flag 0 1
#define MCASP_TXSTAT_XTDMSLOT   0x00000008  // EvenOdd Slot 0 1
#define MCASP_TXSTAT_XCKFAIL    0x00000004  // Bad Transmit Flag 0 1
#define MCASP_TXSTAT_XSYNCERR   0x00000002  // Unexpected XMT Frame sync flag 0
                                            // 1
#define MCASP_TXSTAT_XUNDRN     0x00000001  // XMT Underrun Flag 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXTDMSLOT register.
//
//******************************************************************************
#define MCASP_TXTDMSLOT_XSLOTCNT_M \
                                0x000003FF  // Current XMT time slot count
                                            // during reset the value of this
                                            // register is 0b0101111111 (0x17f)
                                            // and after reset 0

#define MCASP_TXTDMSLOT_XSLOTCNT_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXCLKCHK register.
//
//******************************************************************************
#define MCASP_TXCLKCHK_XCNT_M   0xFF000000  // XMT clock count value
#define MCASP_TXCLKCHK_XCNT_S   24
#define MCASP_TXCLKCHK_XMAX_M   0x00FF0000  // XMT clock maximum boundary
#define MCASP_TXCLKCHK_XMAX_S   16
#define MCASP_TXCLKCHK_XMIN_M   0x0000FF00  // XMT clock minimum boundary
#define MCASP_TXCLKCHK_XMIN_S   8
#define MCASP_TXCLKCHK_RESV     0x00000080  // Reserved
#define MCASP_TXCLKCHK_XPS_M    0x0000000F  // XMT clock check prescaler 0x0
                                            // 0x1 0x2 0x3 0x4 0x5 0x6 0x7 0x8
#define MCASP_TXCLKCHK_XPS_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XEVTCTL register.
//
//******************************************************************************
#define MCASP_XEVTCTL_XDATDMA   0x00000001  // XMT data DMA request 0 Enable
                                            // DMA Transfer 1 Disable DMA
                                            // Transfer
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_CLKADJEN register.
//
//******************************************************************************
#define MCASP_CLKADJEN_ENABLE   0x00000001  // One-shot clock adjust enable 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRA0 register.
//
//******************************************************************************
#define MCASP_DITCSRA0_DITCSRA0_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) Channel
                                            // status

#define MCASP_DITCSRA0_DITCSRA0_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRA1 register.
//
//******************************************************************************
#define MCASP_DITCSRA1_DITCSRA1_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) Channel
                                            // status

