zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_mcasp.h
#define MCASP_DITCSRA1_DITCSRA1_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRA2 register.
//
//******************************************************************************
#define MCASP_DITCSRA2_DITCSRA2_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) Channel
                                            // status Register

#define MCASP_DITCSRA2_DITCSRA2_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRA3 register.
//
//******************************************************************************
#define MCASP_DITCSRA3_DITCSRA3_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) Channel
                                            // status Register

#define MCASP_DITCSRA3_DITCSRA3_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRA4 register.
//
//******************************************************************************
#define MCASP_DITCSRA4_DITCSRA4_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) Channel
                                            // status

#define MCASP_DITCSRA4_DITCSRA4_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRA5 register.
//
//******************************************************************************
#define MCASP_DITCSRA5_DITCSRA5_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) Channel
                                            // status

#define MCASP_DITCSRA5_DITCSRA5_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRB0 register.
//
//******************************************************************************
#define MCASP_DITCSRB0_DITCSRB0_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) Channel
                                            // status

#define MCASP_DITCSRB0_DITCSRB0_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRB1 register.
//
//******************************************************************************
#define MCASP_DITCSRB1_DITCSRB1_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) Channel
                                            // status

#define MCASP_DITCSRB1_DITCSRB1_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRB2 register.
//
//******************************************************************************
#define MCASP_DITCSRB2_DITCSRB2_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) Channel
                                            // status

#define MCASP_DITCSRB2_DITCSRB2_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRB3 register.
//
//******************************************************************************
#define MCASP_DITCSRB3_DITCSRB3_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) Channel
                                            // status

#define MCASP_DITCSRB3_DITCSRB3_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRB4 register.
//
//******************************************************************************
#define MCASP_DITCSRB4_DITCSRB4_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) Channel
                                            // status

#define MCASP_DITCSRB4_DITCSRB4_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITCSRB5 register.
//
//******************************************************************************
#define MCASP_DITCSRB5_DITCSRB5_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) Channel
                                            // status

#define MCASP_DITCSRB5_DITCSRB5_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRA0 register.
//
//******************************************************************************
#define MCASP_DITUDRA0_DITUDRA0_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) User Data

#define MCASP_DITUDRA0_DITUDRA0_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRA1 register.
//
//******************************************************************************
#define MCASP_DITUDRA1_DITUDRA1_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) User Data

#define MCASP_DITUDRA1_DITUDRA1_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRA2 register.
//
//******************************************************************************
#define MCASP_DITUDRA2_DITUDRA2_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) User Data

#define MCASP_DITUDRA2_DITUDRA2_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRA3 register.
//
//******************************************************************************
#define MCASP_DITUDRA3_DITUDRA3_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) User Data

#define MCASP_DITUDRA3_DITUDRA3_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRA4 register.
//
//******************************************************************************
#define MCASP_DITUDRA4_DITUDRA4_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) User Data

#define MCASP_DITUDRA4_DITUDRA4_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRA5 register.
//
//******************************************************************************
#define MCASP_DITUDRA5_DITUDRA5_M \
                                0xFFFFFFFF  // Left (Even TDM slot ) User Data

#define MCASP_DITUDRA5_DITUDRA5_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRB0 register.
//
//******************************************************************************
#define MCASP_DITUDRB0_DITUDRB0_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) User Data

#define MCASP_DITUDRB0_DITUDRB0_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRB1 register.
//
//******************************************************************************
#define MCASP_DITUDRB1_DITUDRB1_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) User Data

#define MCASP_DITUDRB1_DITUDRB1_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRB2 register.
//
//******************************************************************************
#define MCASP_DITUDRB2_DITUDRB2_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) User Data

#define MCASP_DITUDRB2_DITUDRB2_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRB3 register.
//
//******************************************************************************
#define MCASP_DITUDRB3_DITUDRB3_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) User Data

